In [7]:
import pandas as pd

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

### The __pd.concat()__ method

- This method is used to combine two or more dataFrames
- Its first param is a list of the DFs that you want to combine
- It has a _ignore_index_ param that you can use to reset the index to make everything uniform(default: False)
- To be able to differentiate between the two combined DFs, we use a param called _keys_ . Note: when you do this, you do not need to use _ignore_index_

In [9]:
pd.concat([week1,week2], ignore_index= True).tail()

     Customer ID  Food ID
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

In [15]:
pd.concat([week1,week2], keys=["W1", "W2"]).head()
#now we know where the data comes from

      Customer ID  Food ID
W1 0          537        9
   1           97        4
   2          658        1
   3          202        2
   4          155        9

### The .append() Method

The only difference between this method and pd.concat() method is that you call .append() method on the DF object.
However, you call .concat() method on the pd object itself

In [17]:
week2.append(week1, ignore_index= True).head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

![Sql Joins](http://1.bp.blogspot.com/-E3Hj3JNrCuM/T-gRz-tToWI/AAAAAAAAAOI/Azi7Hr7IWV0/s1600/SQL+Joinsjpg.jpg)

## Inner Joins

In [29]:
week1.merge(right=week2, how="inner", on="Customer ID", suffixes= ["-Week1", "-Week2"]).head()

   Customer ID  Food ID-Week1  Food ID-Week2
0          537              9              5
1          155              9              3
2          155              1              3
3          503              5              8
4          503              5              9

See how we joined both DataFrames:
- we used the __.merge()__ method
- the first param: __right__ which indicates which Df you want to merge with
- the second param: __how__ which sets what kind of join you want i.e. inner,outer e.t.c.
- the third param:  __on__ which means on what common field do you want to merge both DFs (this is the _foreign_key in SQL)
- the __suffixes__ param is an indicator for different fields when the DFs are joined. To differentiate.

In [27]:
mask = week1["Customer ID"] == 233
week1[mask]

    Customer ID  Food ID
94          233        3

In [28]:
mask1 = week2["Customer ID"] == 233
week2[mask1]

     Customer ID  Food ID
238          233        3

## Outter Joins

In [34]:
week1.merge(week2, how="outer", on = "Customer ID", suffixes= ["-Week1", "-Week2"], indicator= True).head()

   Customer ID  Food ID-Week1  Food ID-Week2     _merge
0          537            9.0            5.0       both
1           97            4.0            NaN  left_only
2          658            1.0            NaN  left_only
3          202            2.0            NaN  left_only
4          155            9.0            3.0       both

- outter joins combine data that are common to both DFs and inserts NaN to data that are not common
- as opposed to inner joins that only care about the intersections i.e. data that are only present in both DFs
- we can also add an __indicator__ param field that will give us a visiual idea of the type of merge

In [32]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [33]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [43]:
merged = week1.merge(week2, how="outer", on = "Customer ID", suffixes= ["-Week1", "-Week2"], indicator= True)

In [45]:
mask1 = merged["_merge"] == "both"
mask2 = merged["_merge"] == "left_only"
mask3 = merged["_merge"] == "right_only"

merged[~mask1]

     Customer ID  Food ID-Week1  Food ID-Week2      _merge
1             97            4.0            NaN   left_only
2            658            1.0            NaN   left_only
3            202            2.0            NaN   left_only
6            213            8.0            NaN   left_only
7            600            1.0            NaN   left_only
10            71            3.0            NaN   left_only
11            71            8.0            NaN   left_only
12           174            3.0            NaN   left_only
13           961            9.0            NaN   left_only
14           966            5.0            NaN   left_only
15           641            4.0            NaN   left_only
16           288            2.0            NaN   left_only
17           149            4.0            NaN   left_only
18           954            2.0            NaN   left_only
19           147            9.0            NaN   left_only
20           147            8.0            NaN   left_only
23           549            6.0            NaN   left_only
25            78            7.0            NaN   left_only
26           514            5.0            NaN   left_only
27           833            7.0            NaN   left_only
28           833            3.0            NaN   left_only
29           329            8.0            NaN   left_only
30           586           10.0            NaN   left_only
31           341            1.0            NaN   left_only
32           519           10.0            NaN   left_only
33           680            9.0            NaN   left_only
34           419            7.0            NaN   left_only
35            20            1.0            NaN   left_only
36           822            6.0            NaN   left_only
37           226           10.0            NaN   left_only
..           ...            ...            ...         ...
424          622            NaN            9.0  right_only
425          959            NaN            4.0  right_only
426          959            NaN            2.0  right_only
427          810            NaN            2.0  right_only
428          488            NaN            2.0  right_only
429          188            NaN            8.0  right_only
430          305            NaN            2.0  right_only
431          869            NaN            7.0  right_only
432          131            NaN            1.0  right_only
433          208            NaN            4.0  right_only
434          145            NaN            5.0  right_only
435          794            NaN            6.0  right_only
436          734            NaN           10.0  right_only
437          734            NaN            1.0  right_only
438          735            NaN            2.0  right_only
439          940            NaN            8.0  right_only
440          571            NaN            7.0  right_only
441          888            NaN            2.0  right_only
442          664            NaN            6.0  right_only
443          143            NaN            4.0  right_only
444          505            NaN            3.0  right_only
445           54            NaN            8.0  right_only
446          367            NaN            8.0  right_only
447          883            NaN            8.0  right_only
448          251            NaN            9.0  right_only
449          855            NaN            4.0  right_only
450          559            NaN           10.0  right_only
451          276            NaN            4.0  right_only
452          556            NaN           10.0  right_only
453          252            NaN            9.0  right_only

[392 rows x 4 columns]

## Left Joins

- left join is like vlookup in excel
- it takes into consideration all data that are in the left DF and also data in the right DF (that are also present in the left DF) that we want to look up extra info on

In [51]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [47]:
foods.head(3)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99
2        3      Taco   2.99

In [53]:
week1.merge(foods, how="left", on = "Food ID").head()

   Customer ID  Food ID   Food Item  Price
0          537        9       Donut   0.99
1           97        4  Quesadilla   4.25
2          658        1       Sushi   3.99
3          202        2     Burrito   9.99
4          155        9       Donut   0.99

See how it merged the data sets: <br>
- the right DF is the foods data that has all the info about different food IDs

## The left_on and right_on Parameters

- We use these params when the two DFs to be merged do not have a common field label to merge on
- We have to specify on each DF which fields to do the merge
- You can drop the duplicate field during the merger

In [54]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [55]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [71]:
 "Roger" in list(customers["First Name"])
#This is how you do a quick check if a string is in a Series - You must encapsulate the Series with a List
#You do not need to do this with numbers(int)

True

In [77]:
week2.merge(customers, how="left", left_on= "Customer ID", right_on= "ID").head()

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer

From the above see how we specified the left_on and right_on fields. However, see how "Customer ID" and "ID" fields are the same.<br> You can drop one of them during the merger

In [78]:
week2.merge(customers, how="left", left_on= "Customer ID", right_on= "ID").drop("ID", axis = "columns").head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer

## Merging by Indexes with left_index and right_index parameters

In [83]:
foods.head(3)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99
3            Taco   2.99

In [84]:
customers.set_index("ID", inplace= True)

In [86]:
customers.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [87]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [90]:
sales = week1.merge(customers, how="left", left_on='Customer ID', right_index= True)
sales.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III

- see how we merged both DFs on the left's "Customer ID" label and the right's index values
- one advantage of doing this is that we do not get duplicate fields - where we have to drop a field during merger

In [91]:
#Now to get the Food data by their IDs , we will merge the above DF with the foods DF
sales.merge(foods, how="left", left_on="Food ID", right_index=True).head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99

 - You can also use .join() method when you want to merge to DFs with similar index fields
 - You can also do a pd.merge() for merging operations